In [1]:
import pandas as pd

In [2]:
people_data = {
    "first": ["Sam", "Jack", "Samir", "Arun"],
    "last": ["Das", "Smith", "Khan", "Banerjee"],
    "email": ["sam.das@gmail.com", "jack.smith@gmail.com", "samir.khan@gmail.com", "arun.banerjee@gmail.com"]
}

In [4]:
df = pd.DataFrame(people_data)

In [5]:
df

   first      last                    email
0    Sam       Das        sam.das@gmail.com
1   Jack     Smith     jack.smith@gmail.com
2  Samir      Khan     samir.khan@gmail.com
3   Arun  Banerjee  arun.banerjee@gmail.com

In [7]:
def update_email(email):
    return email.upper()

In [9]:
df['email'].apply(update_email)

0          SAM.DAS@GMAIL.COM
1       JACK.SMITH@GMAIL.COM
2       SAMIR.KHAN@GMAIL.COM
3    ARUN.BANERJEE@GMAIL.COM
Name: email, dtype: object

In [11]:
df['email'] = df['email'].apply(update_email)
df

   first      last                    email
0    Sam       Das        SAM.DAS@GMAIL.COM
1   Jack     Smith     JACK.SMITH@GMAIL.COM
2  Samir      Khan     SAMIR.KHAN@GMAIL.COM
3   Arun  Banerjee  ARUN.BANERJEE@GMAIL.COM

In [12]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

   first      last                    email
0    Sam       Das        sam.das@gmail.com
1   Jack     Smith     jack.smith@gmail.com
2  Samir      Khan     samir.khan@gmail.com
3   Arun  Banerjee  arun.banerjee@gmail.com

In [14]:
df['email'].apply(len)

0    17
1    20
2    20
3    23
Name: email, dtype: int64

In [16]:
df.map(len)

   first  last  email
0      3     3     17
1      4     5     20
2      5     4     20
3      4     8     23

In [17]:
df.map(str.lower)

   first      last                    email
0    sam       das        sam.das@gmail.com
1   jack     smith     jack.smith@gmail.com
2  samir      khan     samir.khan@gmail.com
3   arun  banerjee  arun.banerjee@gmail.com

In [24]:
df['first'] = df['first'].replace({'Sam': 'Sumit', 'Samir': 'Amir'})

In [25]:
df

   first      last                    email
0  Sumit       Das        sam.das@gmail.com
1   Jack     Smith     jack.smith@gmail.com
2   Amir      Khan     samir.khan@gmail.com
3   Arun  Banerjee  arun.banerjee@gmail.com